1. 데이터를 저장 후 몇 가지 문제를 코드로 작성합니다.

In [74]:
# 모듈 로딩
import pandas as pd

In [75]:
# 데이터 준비
data={'이름':['메로나','비비빅','죠스바'],
      '가격':[300,400,250],
      '재고':[20,3,100]}

In [76]:
# 1-1 데이터를 저장해 주세요.
DF1=pd.DataFrame(data)
DF1

    이름   가격   재고
0  메로나  300   20
1  비비빅  400    3
2  죠스바  250  100

In [77]:
# 1-2 데이터 저장 후 주요 속성 6가지 출력
print(DF1.index,DF1.values,DF1.columns,DF1.dtypes,DF1.ndim,DF1.shape,sep='\n')

RangeIndex(start=0, stop=3, step=1)
[['메로나' 300 20]
 ['비비빅' 400 3]
 ['죠스바' 250 100]]
Index(['이름', '가격', '재고'], dtype='object')
이름    object
가격     int64
재고     int64
dtype: object
2
(3, 3)

In [78]:
# 1-3 가격 데이터 추출
DF1['가격']

0    300
1    400
2    250
Name: 가격, dtype: int64

In [79]:
# 1-4 이름과 재고 데이터 추출
DF1[['이름','재고']]

    이름   재고
0  메로나   20
1  비비빅    3
2  죠스바  100

In [80]:
# 1-5 비비빅의 가격과 재고 데이터 추출
DF1.loc[1][1:2]

가격    400
Name: 1, dtype: object

In [82]:
# 1-6 메로나와 죠스바의 가격, 재고 데이터 추출
DF1.loc[[0,2],['가격','재고']]

    가격   재고
0  300   20
2  250  100

In [ ]:
# 1-7 행 인덱스를 일 이 삼 으로 변경
DF1.index='일','이','삼'
DF1

    이름   가격   재고
일  메로나  300   20
이  비비빅  400    3
삼  죠스바  250  100

In [ ]:
# 1-8 총가격 컬럼을 추가 후 0으로 값을 채우기
DF1['총가격']=0
DF1

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0

In [ ]:
# 1-9 빵빠레 550원 10개 데이터 추가
DF1.loc['사']='빵빠레','550원','10개',0
DF1

    이름    가격   재고  총가격
일  메로나   300   20    0
이  비비빅   400    3    0
삼  죠스바   250  100    0
사  빵빠레  550원  10개    0

In [ ]:
# 1-10 비비빅의 재고를 23으로 변경
DF1.loc['이','재고']=23
DF1

    이름    가격   재고  총가격
일  메로나   300   20    0
이  비비빅   400   23    0
삼  죠스바   250  100    0
사  빵빠레  550원  10개    0

OHLC 가격정보 데이터입니다.

In [ ]:
# 2-1 데이터 저장 및 컬럼명을 시가,고가,저가,종가로 설정
DF=pd.DataFrame([[2000,3050,2050,1980],[7500,2050,2050,1980],
      [15450,15050,15550,14900]],columns=['시가','고가','저가','종가'])
DF

      시가     고가     저가     종가
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

In [ ]:
# 2-2 데이터 저장 후 주요 속성 6가지 출력
print(DF.index,DF.columns,DF.values,DF.ndim,DF.shape,DF.dtypes)

RangeIndex(start=0, stop=3, step=1) Index(['시가', '고가', '저가', '종가'], dtype='object') [[ 2000  3050  2050  1980]
 [ 7500  2050  2050  1980]
 [15450 15050 15550 14900]] 2 (3, 4) 시가    int64
고가    int64
저가    int64
종가    int64
dtype: object

In [ ]:
# 2-3 행 인덱스를 2024-01-01, 2024-02-01, 2024-03-01 로 변경
DF.index='2024-01-01','2024-02-01','2024-03-01'
DF

               시가     고가     저가     종가
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [ ]:
# 2-4 열 인덱스를 open/high/low/close 로 변경
DF.columns='Open','High','Low','Close'
DF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [ ]:
# 2-5 2024-02-01의 high, close 추출
DF.loc['2024-02-01',['High','Close']]

High     2050
Close    1980
Name: 2024-02-01, dtype: int64

In [ ]:
# 2-6 2024-04-01에 3200 3550 3000 2990 추가

In [ ]:
DF.loc['2024-04-01']=3200,3550,3000,2990
DF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [ ]:
# 2-7 2024-01-01 삭제
# DF.drop('2024-01-01',inplace=True)
DF

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [ ]:
# 2-8 2024-03-01의 low 값 14000으로 변경
DF.loc['2024-03-01','Low']=14000
DF

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  14000  14900
2024-04-01   3200   3550   3000   2990

In [ ]:
# 2-9 Average 컬럼 추가 후 0으로 채우기
DF['Average']=0
DF

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0

In [ ]:
# 2-10 Total 행 추가 후 0으로 채우기
DF.loc['Total']=0
DF

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0
Total           0      0      0      0        0

3. 아래 단답형 문제에 답해주세요.
3-1 판다스는 데이터를 분석하기 위한 패키지  
3-2 판다스에서는 다양한 종류의 데이터를 DataFrame으로 저장합니다.  
3-3 판다스에서는 1차원 데이터를 저장하는 자료구조를 Series  
3-4 2차원 데이터 저장은 DataFrame  
3-5 내부적으로 Array(배열)형태로 저장  
3-6 1개 열 column 추출 시 자료구조는 Sr 입니다  
3-7 1개 행/row 추출 시 자료구조는 Sr입니다  
3-8 2개 이상 열 or 행 추출 시 자료구조는 Df입니다